package com.example.project.MidAutumnTabViewPage

import com.example.project.R

val Title1 = "中秋节来源"
val Content1 =
    "      中秋节，是仲秋之节，在进入秋季的第二个月，以十五月圆为标志，这天正值三秋之中，故谓之“中秋”。此夜月色比平时更亮，又谓之“月夕”。因为中秋节在秋季、八月，又名“秋节”、“八月节”；因为祭月、拜月，又叫“月节”、“月亮节”；中秋家人团聚，出嫁的女儿回家团圆，因此又称“团圆节”、“女儿节”；仲秋时节各种瓜果成熟上市，因称“果子节”。侗族称为“南瓜节”，仫佬族称为“后生节”等。人们在中秋时节欢聚赏月、祭祀、庆贺丰收。 \n" +
            "       中秋节还被称为“端正月”。关于“团圆节”的记载最早见于明代文学作品。《西湖游览志余》中说：“八月十五谓中秋，民间以月饼相送，取团圆之意。”《帝京景物略》中也说：“八月十五祭月，其饼必圆，分瓜必牙错，瓣刻如莲花。……其有妇归宁者，是日必返夫家，曰团圆节也。” \n" +
            "       最初“祭月节”的节期是在干支历二十四节气“秋分”这天，后来才调至夏历（农历）八月十五。根据中国的历法，农历八月在秋季中间，为秋季的第二个月，称为“仲秋”，而八月十五又在“仲秋”之中，所以称“中秋”。"
val image1: Int = 0

val Title2 = "中秋与仲秋"
val Content2 =
    "      中秋一词，最早见于《周礼·夏官司马·大司马》：“中秋，教治兵。”现在也有的写作“仲秋节”，严格地说应为“中秋节”。因为“仲秋”所表示的时间概念是秋天中间的整整一个月。《古今图书集成》用“仲秋部”记载整个的阴历八月，用“中秋部”记载八月十五中秋节这一天。对此，明人徐炬《事物原始》引唐诗人欧阳詹《玩月》序云：“秋之于时，后夏先冬；八月于秋，季始孟终。十五于夜，又月之中。稽于天道，则寒暑均；取诸月数，则蟾兔圆，故曰‘中秋’。言此日为三秋之中也，又谓之月夕。”"
val image2 = R.drawable.mid_autumn_feature

val Title3 = "节日起源"
val Content3 =
    "      中秋节是由天子夕月、秋社、赏月以及月宫的传说等多种风俗事项汇合而成的，它起源于先秦，最后定型于唐朝。\n" +
            "       夕月即古代天子秋分祭祀月亮。《周礼·春官宗伯·典瑞》郑玄注：“天子常春分朝日，秋分夕月。”《史记·孝武本纪》裴骃集解引应劭语曰：“天子春朝日，秋夕月，拜日东门外。朝日以朝，夕月以夕。”现在北京的月坛，原名夕月坛，就是明清皇帝秋分祭月的场所。\n" +
            "       由于秋分的晚上不一定有月亮，有月亮也不一定圆，未免大煞风景，于是民间渐渐把秋分祭月放到中秋了。\n" +
            "       八月中秋正是收获季节，古人要举行祭祀土神的仪式，叫作“秋报”“秋社”。《白虎通·社稷》载：“仲秋之月，择元日，命民社。《援神契》曰：‘仲春祈谷，仲秋获禾，报社祭稷。’”夕月、秋社，可视为中秋节的渊源。"
val image3 = R.drawable.mid_autumn_feature

val Title4 = "节日发展"
val Content4 =
    "      中秋节普及于汉代，汉代是中国南北各地的经济文化交流融合时期，各地文化上的交流使节俗融合传播。据记载，在汉代时，有在中秋或立秋之日敬老、养老，赐以雄粗饼的活动。晋时亦有出现中秋赏月之举的文字记载，不过不太普遍。晋之前中秋节在中国北方地区还不流行。"
val image4 = R.drawable.feature_develop

val Title5 = "盛世流行"
val Content5 =
    "      唐朝时期，中秋风俗在中国北方地区已流行。在唐代中秋节成为了官方认定的全国性节日。《唐书·太宗记》记载有“八月十五中秋节”。中秋赏月风俗在唐代的长安一带极盛，许多诗人的名篇中都有咏月的诗句。并将中秋与嫦娥奔月、吴刚伐桂、玉兔捣药、杨贵妃变月神、唐明皇游月宫等神话故事结合起，使之充满浪漫色彩，玩月之风方才大兴。唐代是传统节日习俗揉合定型的重要时期，其主体部分传承至今。\n" +
            "       北宋时期，正式定阴历八月十五为“中秋节”。文学作品中出现了“小饼如嚼月，中有酥和饴”的节令食品。如孟元老《东京梦华录》说：“中秋夜，贵家结饰台榭，民间争占酒楼玩月”；而且“弦重鼎沸，近内延居民，深夜逢闻笙芋之声，宛如云外。间里儿童，连宵婚戏；夜市骈阗，至于通晓”。"
val image5 = R.drawable.feature_fameous

val Title6 = "演化至今"
val Content6 =
    "      明清时期，岁时节日中世俗的情趣愈益浓厚。明清两朝的赏月活动，“其祭果饼必圆”，各家都要设“月光位”，在月出方向“向月供而拜”。陆启泓《北京岁华记》载：“中秋夜，人家各置月宫符象，符上免如人立；陈瓜果于庭，饼面绘月宫蟾免；男女肃拜烧香，旦而焚之。”《帝京景物略》中也说：“八月十五祭月，其饼必圆，分瓜必牙错，瓣刻如莲花。……其有妇归宁者，是日必返夫家，曰团圆节也。”\n" +
            "       发展至今，吃月饼已经是中国南北各地过中秋节的必备习俗。月饼象征着大团圆，人们把它当作节日食品，用它祭月、赠送亲友。除月饼外，各种时令鲜果干果也是中秋夜的美食。中秋节时，云稀雾少，月光皎洁明亮，民间有赏月、祭月、吃月饼、吃甜薯、提灯笼、舞草龙、树中秋、砌宝塔等一系列的节庆活动。"
val image6 = R.drawable.now

val Title7 = "传统活动"
val Content7 = "      祭月（拜月）\n" + "\n" +
        "       祭月，在中国是一种十分古老的习俗，实际上是古人对“月神”的一种崇拜活动。在古代有“秋暮夕月”的习俗。夕月，即拜祭月神。自古以来，在广东部分地区，人们都有在中秋晚上拜祭月神（拜月娘、拜月光）的习俗。拜月，设大香案，摆上月饼、西瓜、苹果、红枣、李子、葡萄等祭品。在月下，将“月神”牌位放在月亮的那个方向，红烛高燃，全家人依次拜祭月亮，祈求福佑。祭月赏月，托月追思，表达了人们的美好祝愿。祭月作为中秋节重要的祭礼之一，从古代延续至今。\n" + "\n" +
        "       赏月\n" + "\n" +
        "       中秋赏月风俗的正式形成是在唐代。据《开元天宝遗事》载，八月十五日夜，唐玄宗备文酒之宴，与禁中直宿诸学士玩月。以后每年八月十五，都照例赏月。为了与杨贵妃一起望月，还敕令于太液池西岸筑百丈高台，因安史之乱爆发，没有修成。自唐玄宗以后，中秋咏月诗大量出现了。如唐诗人白居易的《八月十五日湓亭望月》云：“西北望乡何处是，东南见月几回圆。”韦庄的《送李秀才归荆溪》云：“八月中秋月正圆，送君吟上木兰船。”司空图《中秋》云：“此夜若无月，一年虚过秋。”北宋苏东坡的《水调歌头》云：“明月几时有？把酒问青天。”都是中秋赏月的佳句。不仅文人学士赏月、咏月，平民百姓亦“千家看露湿，万里觉天清”。宋代中秋节赏月的风俗十分盛行。《东京梦华录》卷八《中秋》载：“中秋节前，诸店皆卖新酒，重新结络门面、彩楼、花头、画竿、醉仙锦旆。市人争饮至午未间……中秋夜，贵家结饰台榭，民间争占酒楼玩月……儿童连宵嬉戏，夜市骈阗，至于通晓。\n”" + "\n" +
        "       追月\n" + "\n" +
        "       所谓“追月”，即是过了农历八月十五，兴犹未尽，于是次日的晚上，不少人又邀约亲朋好友，继续赏月，名为“追月”。据清人陈子厚《岭南杂事钞》序云：“粤中好事者，于八月十六夜，集亲朋治酒肴赏月，谓之追月。”\n" + "\n" +
        "       猜谜\n" + "\n" +
        "       中秋月圆夜在公共场所挂着许多灯笼，人们都聚集在一起，猜灯笼身上写的谜语，因为是大多数年轻男女喜爱的活动，同时在这些活动上也传出爱情佳话，因此中秋猜灯谜也被衍生了一种男女相恋的形式。\n" + "\n" +
        "       吃月饼\n" + "\n" +
        "       月饼，又叫月团、丰收饼、宫饼、团圆饼等，是古代中秋祭拜月神的贡品。月饼最初是用来祭奉月神的供品，后来人们逐渐把中秋赏月与品尝月饼，作为家人团圆的一大象征。月饼象征着大团圆，人们把它当作节日食品，用它祭月、赠送亲友。发展至今，吃月饼已经是中国南北各地过中秋节的必备习俗，中秋节这天人们都要吃月饼以示“团圆”。"
val image7 = R.drawable.mooncake

val Title8 = "地方特色"
val Content8 = "      湖广燃灯\n" + "\n" +
        "       中秋之夜，有燃灯以助月色的风俗。如今湖广一带仍有用瓦片叠塔于塔上燃灯的节俗。江南一带则有制灯船的节俗。近代中秋燃灯之俗更盛。今人周云锦、何湘妃《闲情试说时节事》一文说：“广东张灯最盛，各家于节前十几天，就用竹条扎灯笼。做果品、鸟兽、鱼虫形及‘庆贺中秋’等字样，上糊色纸绘各种颜色。中秋夜灯内燃烛用绳系于竹竿上，高竖于瓦檐或露台上，或用小灯砌成字形或种种形状，挂于家屋高处，俗称‘树中秋’或‘竖中秋’。富贵之家所悬之灯，高可数丈，家人聚于灯下欢饮为乐，平常百姓则竖一旗杆，灯笼两个，也自取其乐。满城灯火不啻琉璃世界。”中秋燃灯之俗其规模似乎仅次于元宵灯节。 \n" + "\n" +
        "       浙江观潮\n" + "\n" +
        "       在古代，浙江一带除中秋赏月外，观潮可谓是又一中秋盛事。中秋观潮的风俗由来已久，早在汉代枚乘的《七发》赋中就有了相当详尽的记述。汉以后，中秋观潮之风更盛。明朱廷焕《增补武林旧事》和宋吴自牧《梦粱录》也有观潮记载。\n" + "\n" +
        "       广东树中秋\n" + "\n" +
        "       在广东一些地方，中秋节有一种富有情趣的传统风俗，叫“树中秋”。树亦作竖，即将灯彩高竖起来之意，所以也叫“竖中秋”。小孩子们在家长协助下用竹纸扎成兔仔灯、杨桃灯或正方形的灯，横挂在短竿中，再竖起于高杆上，高举起来，彩光闪耀，为中秋再添一景。孩子们多互相比赛，看谁竖得高，竖得多，灯彩最精巧。入夜，满城灯火，如繁星点点，和天上明月争辉，以此庆贺中秋。"
val image8 = R.drawable.moon

val Title9 = "民族特色"
val Content9 = "      蒙古族\n" + "\n" +
        "       蒙古族人爱做“追月”的游戏。人们跨上骏马，在银白色月光下，奔驰在草原上。他们朝西放马奔驰，月亮由东方升起，坠落西方。执着的蒙古骑手，不到月亮西下，“追月”不止。\n" + "\n" +
        "       藏族\n" + "\n" +
        "       西藏一些地区的藏族同胞欢度中秋的习俗是“寻月”。是日夜晚，男女青年和娃娃们，沿着河流，跟着倒映水中的明月，把周围河塘中的月影措遍，然后回家团圆吃月饼。\n" + "\n" +
        "       广西侗族\n" + "\n" +
        "       广西侗族有“行月”的习俗。中秋夜临，各山寨的芦笙歌舞队，踏着一路月光，行至临近山寨，和那儿的寨民相聚赏月，赛歌赛舞，彻夜长欢。\n" + "\n" +
        "       云南德昂族\n" + "\n" +
        "       云南德昂族“串月”。云南潞西的德昂族青年男女，每逢中秋月明高挂，分外明亮的时候，山头塞尾，不时传来一阵悠扬动听的葫芦笙，男女青年在一起“串月亮”倾诉衷情。有的还通过“串月亮”送槟榔、送茶订下婚约。\n" + "\n" +
        "       云南彝族\n" + "\n" +
        "       云南彝族过中秋的传统习俗是“跳月”。入夜，该族各个村寨的男女老幼都聚集在山村中的开阔地，一个个束腰披纱的姑娘们和头缠布带的小伙子们以及老头、老太太、小娃子们都激情地载歌载舞，尤其是那些青年男女表达爱慕之情的对歌，仿佛月亮也听得为之动情动容，越发显得妩媚皎洁。\n" + "\n" +
        "       仡佬族\n" + "\n" +
        "       仡佬族在节前的“虎日”，全寨合宰一头公牛，将牛心留到中秋夜祭祖灵、迎新谷，他们称为“八月节”。"
val image9 = R.drawable.moon

val Title10 = "国外习俗"
val Content10 = "     朝鲜半岛\n" + "\n" +
        "       韩语称“추석（秋夕）”“중추절（仲秋节）”“가배（嘉俳）”“중추（仲秋）”“가배일（嘉俳日）”“중추가절（仲秋佳节）”。是扫墓并用新收获的谷物和果实祭祀先祖的日子。回乡探亲，向亲朋戚友送礼亦是过中秋节的习俗。所以英文亦把朝鲜半岛的中秋节叫做“韩国感恩节”（Korean Thanksgiving Day）。 \n" + "\n" +
        "       越南\n" + "\n" +
        "       中秋节也是越南儿童的一个节日。当晚，孩子们聆听关于阿贵的传说，去看舞狮，有的还得到父亲给他买一个用来舞狮的狮子跟朋友们一起玩耍。 越南孩子在中秋夜均要提鲤鱼灯出游玩耍，还预示长大“跳龙门”之意。\n" + "\n" +
        "       日本\n" + "\n" +
        "       日本传统的中秋节被称为十五夜，也叫中秋名月、芋名月。日本人在赏月的时候吃江米团子，称为“月见团子”。由于这个时期正值各种作物的收获季节，为了对自然的恩惠表示感谢，日本人要举行各种庆祝活动。日本人也会赏月，称之为“月见”，屋内会陈列赏月团子、芒草、芋等。 \n" + "\n" +
        "       新加坡\n" + "\n" +
        "       新加坡是一个华人占人口绝大多数的国家，对于一年一度的中秋佳节向来十分重视。对新加坡的华人来说，中秋佳节是联络感情，表示谢意的天赐良机。亲朋好友、商业伙伴之间相互馈赠月饼，借此表示问候与祝愿。 \n" + "\n" +
        "       马来西亚\n" + "\n" +
        "       吃月饼、赏月、提灯笼游行是马来西亚华人世代相传的中秋习俗。中秋临近，马来西亚各地的老字号商家纷纷推出各色月饼。首都吉隆坡市内各大商场都设有月饼专柜，报纸、电视台的月饼广告铺天盖地，为喜迎中秋营造了节日气氛。吉隆坡一些地方的华人社团当前举行了提灯笼游行庆中秋活动，除舞龙舞狮外，一辆辆载有“嫦娥”、“七仙女”的花车漫游其间，服饰鲜艳的艺人和青年载歌载舞。"
val image10 = R.drawable.moon

val Title11 = "神话故事"
val Content11 = "     嫦娥奔月\n" + "\n" +
        "       “嫦娥奔月”神话源自古人对星辰的崇拜，嫦娥奔月故事最早出现在《归藏》。后来民间把故事进一步发挥，衍化成多个故事版本。嫦娥登上了月宫，据西汉《淮南子》中说，是因为她偷吃了她丈夫后羿从西王母那里要来的不死药，就飞进月宫，变成了捣药的蟾蜍。\n" + "\n" +
        "       吴刚伐桂\n" + "\n" +
        "       吴刚登上月宫折桂，据唐代小说《酉阳杂俎》中说，是因为西何人吴刚修仙犯了错误，才罚他去伐月中的桂树。这桂树随砍随长，永远也砍不断。李白在《赠崔司户文昆季》一诗中写道：“欲斫月中桂，持为寒者薪。”" + "\n" +
        "       玉兔捣药\n" + "\n" +
        "       兔子登上月宫捣药，最早见于屈原的《天问》“厥利维何，而顾、菟在腹？”。意思是说，顾、菟在月亮的肚子里，对月亮有什么好处呢？那兔子又是如何登上月宫的呢？顾就是蟾蜍，菟就是白兔。晋代傅玄的《拟天问》也说：“月中何有，白兔捣药。”据闻一多先生考证，这“白兔捣药”是由“蟾蜍捣药”变来的。\n" +
        "       嫦娥身边有只玉兔。据说嫦娥身体变轻，开始升空时，惶恐中抱起了一直喂养的白兔。白兔便随她一起上了月亮。玉兔在月宫有一只捣药杵，夜晚在药臼中捣制长生不老的灵药。这个神话传到日本后，变成了玉兔在捣年糕。"
val image11 = R.drawable.girl

val Title12 = "节日含义"
val Content12 =
    "     中秋节的最大特征是将人与自然美好的愿望寄托在天上。中秋节时正当农业丰收的季节，月饼和瓜果既是祭神媒介，也是人们庆祝丰收美好心情的具体象征。人们在追求花好月圆美景的同时，加强了亲情关系，因此这一传统节日对建设和谐社会有重要价值。同时中秋节是一个团圆活泼的大节，其崇尚内容虽然正在淡化，但娱乐、节日饮食等活动还相当活跃。\n" +
            "       节日及其民俗活动的形成和发展是某一时期政治政策、信仰文化、民间经济等因素共同作用的结果。它不仅反映一个民族、一个群体的思维模式和审美趣味，同时也是加深族群联系、延续民族文化的重要机制。节日的流变和各种习俗符号的变化过程，对我们深入认识中华文化内涵、筑牢民族共同体意识具有重要意义。"
val image12 = 0

val featureList = listOf(
    Item(
        title = Title1,
        content = Content1,
        imageResId = image1
    ),
    Item(
        title = Title2,
        content = Content2,
        imageResId = image2
    ),
    Item(
        title = Title3,
        content = Content3,
        imageResId = image3
    ),
    Item(
        title = Title4,
        content = Content4,
        imageResId = image4
    ),
    Item(
        title = Title5,
        content = Content5,
        imageResId = image5
    ),
    Item(
        title = Title6,
        content = Content6,
        imageResId = image6
    ),
    Item(
        title = Title7,
        content = Content7,
        imageResId = image7
    ),
    Item(
        title = Title8,
        content = Content8,
        imageResId = image8
    ),
    Item(
        title = Title9,
        content = Content9,
        imageResId = image9
    ),
    Item(
        title = Title10,
        content = Content10,
        imageResId = image10
    ),
    Item(
        title = Title11,
        content = Content11,
        imageResId = image11
    ),
    Item(
        title = Title12,
        content = Content12,
        imageResId = image12
    ),
)